; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v1 - type_2 ?v2 - type_3)
 	      (pred_2 ?v7 - object ?v2 - type_3)
	      (pred_1 ?v1 - type_2 ?v5 - type_1)
	      (pred_4 ?v1 - type_2 ?v7 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v1 - type_2 ?v8 ?v4 - type_3)
       :precondition (and  (pred_3 ?v1 ?v8))
       :effect (and  (pred_3 ?v1 ?v4)
		     (not (pred_3 ?v1 ?v8))))

   (:action op_1
       :parameters (?v1 - type_2 ?v6 - object ?v3 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v3) (pred_3 ?v1 ?v3) (pred_1 ?v1 ?v5))
       :effect (and (pred_4 ?v1 ?v6 ?v5)
		    (not (pred_2 ?v6 ?v3)) 
		    (not (pred_1 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_2 ?v6 - object ?v3 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v1 ?v6 ?v5) (pred_3 ?v1 ?v3))
       :effect (and (pred_2 ?v6 ?v3)
		    (pred_1 ?v1 ?v5)
		    (not (pred_4 ?v1 ?v6 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_2
obj_07 obj_02 - type_1
obj_08 obj_01 obj_05 obj_09 - type_3
obj_10 obj_03 obj_04 - object)
(:init
(pred_3 obj_06 obj_01)
(pred_1 obj_06 obj_07)
(pred_1 obj_06 obj_02)
(pred_2 obj_10 obj_09)
(pred_2 obj_03 obj_01)
(pred_2 obj_04 obj_05)
)
(:goal
(and
(pred_2 obj_10 obj_01)
(pred_2 obj_03 obj_01)
(pred_2 obj_04 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_06 ?b obj_02))))
)
)

; plan
1. (op_3 obj_06 obj_01 obj_05)
   deleted: (pred_3 obj_06 obj_01)
   added: (pred_3 obj_06 obj_05)
   goals met: 1 of 3
2. (op_1 obj_06 obj_04 obj_05 obj_07)
   deleted: (pred_2 obj_04 obj_05) (pred_1 obj_06 obj_07)
   added: (pred_4 obj_06 obj_04 obj_07)
   goals met: 1 of 3
3. (op_3 obj_06 obj_05 obj_09)
   deleted: (pred_3 obj_06 obj_05)
   added: (pred_3 obj_06 obj_09)
   goals met: 1 of 3
4. (op_2 obj_06 obj_04 obj_09 obj_07)
   deleted: (pred_4 obj_06 obj_04 obj_07)
   added: (pred_2 obj_04 obj_09) (pred_1 obj_06 obj_07)
   goals met: 2 of 3
5. (op_1 obj_06 obj_10 obj_09 obj_07)
   deleted: (pred_2 obj_10 obj_09) (pred_1 obj_06 obj_07)
   added: (pred_4 obj_06 obj_10 obj_07)
   goals met: 2 of 3
6. (op_3 obj_06 obj_09 obj_01)
   deleted: (pred_3 obj_06 obj_09)
   added: (pred_3 obj_06 obj_01)
   goals met: 2 of 3
7. (op_2 obj_06 obj_10 obj_01 obj_07)
   deleted: (pred_4 obj_06 obj_10 obj_07)
   added: (pred_2 obj_10 obj_01) (pred_1 obj_06 obj_07)
   goals met: 3 of 3
